#include <iostream>

using namespace std;

int min(int n, ...) {
    int *p = &n;
    int min = *(++p);
    for (; n > 0; n--) {
        if (min > *(p)) {
            min = *(p);
        }
        p++;
    }
    return min;
}

int main() {
    cout << "Минимум из [3, 1, 2, 4, 5]:\t" << min(5, 3, 1, 2, 4, 5) << "\n";
    cout << "Минимум из [31, 122, 244, 41, 54, 12, 36, 45, 988, 45]:\t"
         << min(10, 31, 122, 244, 41, 54, 12, 36, 45, 988, 45) << "\n";
    cout << "Минимум из [-9, -1, 52, 6994, -665, 4, 56, 21, 4, -26, 122, 54, 96, -123, 222]:\t"
         << min(15, -9, -1, 52, 6994, -665, 4, 56, 21, 4, -26, 122, 54, 96, -123, 222);
}